"use strict";


// условие 

if (4 == 9) { // если поместить какую то цифру обычную , то условие будет всегда выполняться и всегда верно 
    console.log("ok!");
} else {
    console.log("Eror");
}


const num = 50;
if (num < 49) {
    console.log("Eror"); // начинает по одному каждое условие проверять 
} else if (num >= 50) {
    console.log("Mnogo");
} else {
    console.log("ok");
}

const ter = 50;
(ter == 50) ? console.log("Ok"): console.log("error"); // теренарный оператор 

let age = 19;
let message = (age < 3) ? 'Здравствуй, малыш!' : // теренарный оператор 
  (age < 18) ? 'Привет!' :
  (age < 100) ? 'Здравствуйте!' :
  'Какой необычный возраст!';

console.log( message );

/* alert(message); */


const a = 50;
switch (a) { // строгая проверка switch
    case 49:
        console.log("Неверно");
        break;
    case 50:
        console.log("verno");
        break;
    default:
        console.log("Ne v etot raz");
        break;
}


// циклы


let c = 50;

while (c <= 55) {
    console.log(c);
    c++;

}
////////////////////////////////////////////////////////////////////////////////
do {
    console.log(c);
    c++;
} while (c <= 55);

///////////////////////////////////////////////////////////////////////////////
for (let i = 1; i <= 8; i++) {
    console.log(i);
}

///////////////////////////////////////////////////////////////////////////////

let b = 10;
for (let i = 1; i <= 8; i++) {
    console.log("i=" + i); // это количество на сколько раз ты будешь ее увеличивать 
    b++;
    console.log("b=" + b);

}

///////////////////////////////////////////////////////////////////////////////

for (let i = 1; i < 0; i++) { // это бесконечный цикл
    console.log("i=" + i);
}

///////////////////////////////////////////////////////////////////////////////


for (let i = 1; i < 10; i++) { // можно прервать на 6
    if (i == 6) {
        break;
    }
    console.log("i=" + i);
}

///////////////////////////////////////////////////////////////////////////////

for (let i = 1; i < 10; i++) { // можно прервать на 6
    if (i == 6) {
        continue; // 6 пропускает 
    }
    console.log("i=" + i);
}